In [2]:
%load_ext autoreload
%autoreload 2

In [3]:
from src.data_loader import DataLoader
from src.preprocess import cambio_escala

In [44]:
datos_personales = DataLoader().load_datos_personales()
print(datos_personales.shape[0])
datos_personales.head()

59

   user         name  age sex  occupation  children  y_c_age  o_c_age
0   123  Usuario_123   37   F           3         1        3        8
1   124  Usuario_124   42   M           8         1        3        8
2   125  Usuario_125   35   F          10         0        0        0
3   126  Usuario_126   50   M           4         0        0        0
4   127  Usuario_127   66   F          11         1       35       44

In [5]:
puntuaciones_usuarios = DataLoader().load_puntuaciones()
puntuaciones_usuarios = cambio_escala(puntuaciones_usuarios)
puntuaciones_usuarios.head(10)

   user  place  score
0   123  17376   8.33
1   123  17377   8.33
2   123  17380   8.33
3   123  17392   3.33
4   123  17395   5.00
5   123  17405   3.33
6   123  17411   0.00
7   123  17421   1.67
8   123  17425   8.33
9   123  17426   8.33

In [6]:
puntuaciones_usuarios_test = DataLoader().load_puntuaciones_test()
puntuaciones_usuarios_test = cambio_escala(puntuaciones_usuarios_test)
puntuaciones_usuarios_test.head(10)

   user  place  score
0   123  17365   8.33
1   123  17366   3.33
2   123  17367   3.33
3   123  17369   8.33
4   123  17371   8.33
5   123  17372   8.33
6   123  17374  10.00
7   123  17375   8.33
8   123  17378   0.00
9   123  17379   6.67

In [7]:
clasificaciones_items = DataLoader().load_clasificacion_items()
clasificaciones_items.head(10)

    item preference  score
0  17365         65     61
1  17365         68     67
2  17366         62     78
3  17366         68     75
4  17367         26     20
5  17367         68     61
6  17369         50     60
7  17369         62     66
8  17369        115     45
9  17371         27     61

In [8]:
items = DataLoader().load_items()
items.head(10)

    item                                              name  views
0  17365                Casa de las Rocas-Museo del Corpus     11
1  17366                              Casa-Museo Benlliure     11
2  17367                          Casa-Museo Blasco Ibañez     11
3  17369                 Centro cultural Fundación Bancaja     30
4  17371                            Centro del Carmen-IVAM     26
5  17372                        Centro Julio Gonzalez-IVAM     23
6  17374                                  El Oceanográfico     35
7  17375       Museo de Bellas Artes de Valencia-San Pio V     22
8  17376  Museo de Cerámica (Palacio Marqués de Dos Aguas)     26
9  17377                     Museo de historia de Valencia     19

In [9]:
preferencias = DataLoader().load_preferencias()
preferencias.head(20)

    preference                        name  father
0            1          Estilos y periodos       0
1            2                     Compras       0
2            3                      Museos       0
3            4           Espacios Abiertos       0
4            5      Arquitectura religiosa       0
5            6      Arquitectura defensiva       0
6            7          Arquitectura civil       0
7            8                 Gastronomia       0
8            9                    Deportes       0
9           10                  Monumentos       0
10          11                        Ocio       0
11          12                 Salud y SPA       0
12          13                     Eventos       0
13          14                       Niños       0
14          15  Patrimonio de la Humanidad       0
15          16                Prehistórico       1
16          17                       Árabe       1
17          18                      Romano       1
18          19                    Medieval       1
19          20                      Gótico       1

In [10]:
usuarios_preferencias = DataLoader().load_usuarios_preferencias()
usuarios_preferencias = usuarios_preferencias.merge(preferencias, how= 'inner', on='preference')
usuarios_preferencias[['user', 'name', 'score', 'father']]
usuarios_preferencias.groupby('father')

In [11]:
ocupaciones = DataLoader().load_ocupaciones()
ocupaciones.head(20)

    occupation                                               name
0            1                                    Fuerzas armadas
1            2  Dirección de las empresas y de las administrac...
2            3  Técnicos y profesionales científicos e intelec...
3            4                  Técnicos y profesionales de apoyo
4            5                   Empleados de tipo administrativo
5            6  Trabajadores de los servicios de restauración,...
6            7  Trabajadores cualificados en la agricultura y ...
7            8  Artesanos y trabajadores cualificados de indus...
8            9  Operadores de instalaciones y maquinaria, y mo...
9           10                       Trabajadores no cualificados
10          11                              Inactivo o desocupado

In [33]:
df_merged = datos_personales.merge(ocupaciones, on='occupation', how='left', suffixes=('', '_ocuppation'))
df_merged.rename(columns={'user': 'user_id','name_ocuppation': 'occupation', 'occupation': 'id_occupation', 'y_c_age': 'young_children_age', 'o_c_age': 'older_children_age'}, inplace=True)
df_merged.head()

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
0,123,Usuario_123,37,F,3,1,3,8,Técnicos y profesionales científicos e intelec...
1,124,Usuario_124,42,M,8,1,3,8,Artesanos y trabajadores cualificados de indus...
2,125,Usuario_125,35,F,10,0,0,0,Trabajadores no cualificados
3,126,Usuario_126,50,M,4,0,0,0,Técnicos y profesionales de apoyo
4,127,Usuario_127,66,F,11,1,35,44,Inactivo o desocupado

In [88]:
df_merged.groupby('occupation').count()

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age
occupation,,,,,,,,
"Artesanos y trabajadores cualificados de industrias manufactureras, construcción, y minería, excepto operadores de instalaciones y maquinaria",2,2,2,2,2,2,2,2
Dirección de las empresas y de las administraciones públicas,6,6,6,6,6,6,6,6
Empleados de tipo administrativo,7,7,7,7,7,7,7,7
Fuerzas armadas,12,12,12,12,12,12,12,12
Inactivo o desocupado,3,3,3,3,3,3,3,3
"Trabajadores de los servicios de restauración, personales, protección y vendedores de los comercios",2,2,2,2,2,2,2,2
Trabajadores no cualificados,2,2,2,2,2,2,2,2
Técnicos y profesionales científicos e intelectuales,20,20,20,20,20,20,20,20
Técnicos y profesionales de apoyo,4,4,4,4,4,4,4,4

In [100]:
fuerzas_armadas_no_hijos_jovenes = df_merged[(df_merged['id_occupation'] == 1) &
                                       (df_merged['children'] == 0) &
                                         (df_merged['young_children_age'] == 0)
                                         & (df_merged['age'] < 40)]

print(fuerzas_armadas_no_hijos_jovenes.shape[0])
fuerzas_armadas_no_hijos_jovenes

6

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
26,149,Usuario_149,32,F,1,0,0,0,Fuerzas armadas
38,161,Usuario_161,25,F,1,0,0,0,Fuerzas armadas
43,166,Usuario_166,24,F,1,0,0,0,Fuerzas armadas
44,167,Usuario_167,32,F,1,0,0,0,Fuerzas armadas
54,177,Usuario_177,23,F,1,0,0,0,Fuerzas armadas
55,178,Usuario_178,36,F,1,0,0,0,Fuerzas armadas

In [102]:
hombres_sin_hijos_jovenes = df_merged[ (df_merged['sex'] == 'M') &
                                (df_merged['age'] < 40) &
                                (df_merged['children'] == 0) ]

print(hombres_sin_hijos_jovenes.shape[0])
hombres_sin_hijos_jovenes.head()

7

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
10,133,Usuario_133,24,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
15,138,Usuario_138,33,M,8,0,0,0,Artesanos y trabajadores cualificados de indus...
21,144,Usuario_144,28,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
48,171,Usuario_171,29,M,3,0,0,0,Técnicos y profesionales científicos e intelec...
49,172,Usuario_172,37,M,3,0,0,0,Técnicos y profesionales científicos e intelec...

In [104]:
mujeres_sin_hijos_jovenes = df_merged[ (df_merged['sex'] == 'F') &
                                (df_merged['age'] < 30) &
                                (df_merged['children'] == 0) ]

print(mujeres_sin_hijos_jovenes.shape[0])
mujeres_sin_hijos_jovenes.head()

8

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
8,131,Usuario_131,25,F,2,0,0,0,Dirección de las empresas y de las administrac...
14,137,Usuario_137,26,F,5,0,0,0,Empleados de tipo administrativo
22,145,Usuario_145,27,F,6,0,0,0,"Trabajadores de los servicios de restauración,..."
25,148,Usuario_148,26,F,10,0,0,0,Trabajadores no cualificados
38,161,Usuario_161,25,F,1,0,0,0,Fuerzas armadas

In [109]:
dos_hijos_similares = df_merged[ ((df_merged['young_children_age'] > 0) & (df_merged['young_children_age']<10)) & (df_merged['older_children_age'] > 0) ]

print('filas', dos_hijos_similares.shape[0])
dos_hijos_similares

filas 8

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
0,123,Usuario_123,37,F,3,1,3,8,Técnicos y profesionales científicos e intelec...
1,124,Usuario_124,42,M,8,1,3,8,Artesanos y trabajadores cualificados de indus...
6,129,Usuario_129,42,F,5,1,5,11,Empleados de tipo administrativo
7,130,Usuario_130,37,F,3,1,1,6,Técnicos y profesionales científicos e intelec...
11,134,Usuario_134,41,F,5,1,4,7,Empleados de tipo administrativo
12,135,Usuario_135,40,M,1,1,4,6,Fuerzas armadas
30,153,Usuario_153,42,F,5,1,5,7,Empleados de tipo administrativo
56,179,Usuario_179,40,F,3,1,3,5,Técnicos y profesionales científicos e intelec...

In [ ]:
personas_libres = df_merged[(df_merged['id_occupation'] == 11) |
                             (df_merged['age'] > 60) &
                               ((df_merged['young_children_age'] > 25) | (df_merged['children'] == 0))]

print('filas', personas_libres.shape[0])
personas_libres

filas 6

,user_id,name,age,sex,id_occupation,children,young_children_age,older_children_age,occupation
4,127,Usuario_127,66,F,11,1,35,44,Inactivo o desocupado
5,128,Usuario_128,79,F,11,1,50,56,Inactivo o desocupado
23,146,Usuario_146,63,M,2,0,0,0,Dirección de las empresas y de las administrac...
31,154,Usuario_154,63,F,3,1,29,39,Técnicos y profesionales científicos e intelec...
33,156,Usuario_156,77,F,11,1,46,55,Inactivo o desocupado
34,157,Usuario_157,63,F,3,0,0,0,Técnicos y profesionales científicos e intelec...